package YLAB.JavaRush.Lesson_1;

public class Task_2 {
    public static void main(String[] agrs) {
        /*
        Написать программу, которая выводит на экран строки:
        Меня зовут Амиго.

        Я согласен на зарплату $800/месяц в первый год.
        Я согласен на зарплату $1500/месяц во второй год.
        Я согласен на зарплату $2200/месяц в третий год.
        Я согласен на зарплату $2700/месяц в четвертый год.
        Я согласен на зарплату $3200/месяц в пятый год.

        Поцелуй мой блестящий металлический зад!
        */
        System.out.println("\n");
        System.out.println("Меня зовут Амиго.\n");
        System.out.println("Я согласен на зарплату $800/месяц в первый год.");
        System.out.println("Я согласен на зарплату $1500/месяц во второй год.");
        System.out.println("Я согласен на зарплату $2200/месяц в третий год.");
        System.out.println("Я согласен на зарплату $2700/месяц в четвертый год.");
        System.out.println("Я согласен на зарплату $3200/месяц в пятый год.\n");
        System.out.println("Поцелуй мой блестящий металлический зад!");
    }
}
